tutorials/Tube/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.003;

z  333.33;// z=nD/scaling factor

vertices
(
    (0 0 0)//0
    (0.999 0.04362 0)//1
    (0.999 0.04362 $z)//2
    (0 0 $z)//3
    (0.999 -0.04362 0)//4
    (0.999 -0.04362 $z)//5

);

nx  30;
nz  200;

blocks
(
    hex (0 4 1 0 3 5 2 3) ($nx 1 $nz) simpleGrading (1 1 1)

);

edges
(
);

boundary
(
    front
    {
        type wedge;
        faces
        (
            (0 1 2 3)
            
        );
    }
    back
    {
        type wedge;
        faces
        (
           (0 3 5 4)
        );
    }
    tube
    {
        type wall;
        faces
        (
            (1 4 5 2)

        );
    }
    outlet
    {
        type patch;
        faces
        (
            (3 5 2 3)
        
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 1 0)
        
        );
    }
    axis
    {
        type empty;
        faces
        (
            (0 3 3 0)
        
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
