tutorials/Tube/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    front
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          6000;
        startFace       11770;
    }
    back
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          6000;
        startFace       17770;
    }
    tube
    {
        type            wall;
        inGroups        1(wall);
        nFaces          200;
        startFace       23770;
    }
    outlet
    {
        type            patch;
        nFaces          30;
        startFace       23970;
    }
    inlet
    {
        type            patch;
        nFaces          30;
        startFace       24000;
    }
    axis
    {
        type            empty;
        inGroups        1(empty);
        nFaces          0;
        startFace       24030;
    }
)

// ************************************************************************* //
