tutorials/Tube/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
////////////////////////////for-turb-solver//////////////////////////
transportModel Newtonian;
nu                     nu [ 0 2 -1 0 0 0 0 ] 6.96817160237369e-7;
Prt                    Prt [ 0 0 0 0 0 0 0 ] 0.85;
SchmitTurb             SchmitTurb [ 0 0 0 0 0 0 0 ] 0.85;
//////////////////////////////////AL2O3
rho_p			rho_p [ 1 -3 0 0 0 0 0 ] 3970;
k_p			k_p [1 1 -3 -1 0 0 0] 40;
c_p			c_p [ 0 2 -2 -1 0 0 0 ] 765;
dp			dp [ 0 1 0 0 0 0 0 ] 33e-9;
alphaRef		alphaRef [0 0 0 0 0 0 0 ] 0.04;
/////////////////////////////////////water in T=295K
rho_f			rho_f [ 1 -3 0 0 0 0 0 ] 997;
k_f			k_f [1 1 -3 -1 0 0 0] 0.59;
c_f			c_f [ 0 2 -2 -1 0 0 0 ] 4179;
df			df [ 0 1 0 0 0 0 0 ] 0.385e-9;
mu_f			mu_f [ 1 -1 -1 0 0 0 0 ] 890e-6;
//////////////////////////////////////////////constants
k_Boltzman		k_Boltzman [ 1 2 -2 -1 0 0 0 ] 1.38064e-23;//Boltzman canstant
alphaEqActivation	alphaEqActivation [0 0 0 0 0 0 0] 1;
lambda			lambda [ 0 0 0 0 0 0 0 ] 3;

// ************************************************************************* //
