tutorials/Tube/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.000016834;


boundaryField
{
    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
	intensity	0.05;
        value           uniform 0.000016834;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.000016834;
    }
    tube
    {
        type            kqRWallFunction;
        value           uniform 0;
    }
    front
    {
        type            wedge;     
    }
    back
    {
        type            wedge;  
    }
    axis
    {
        type            empty;
    }
}


// ************************************************************************* //
